## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.audit_logs_archiver will be created
  + resource "aws_cloudwatch_log_group" "audit_logs_archiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:687401027353:key/c5c2a1c2-c092-4fa1-8daf-3414f3511b1d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Audit_Logs_Archiver"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lambda_function.audit_logs_archiver will be created
  + resource "aws_lambda_function" "audit_logs_archiver" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "Audit_Logs_Archiver"
      + handler                        = "audit_logs_archiver.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::687401027353:role/iam_for_lambda"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "forms-staging-lambda-code"
      + s3_key                         = "audit_logs_archiver_code"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "m/mF42mBPSutTiaRape0GvZe3RqSfUkxtziCLZ1lAzk="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AUDIT_LOGS_ARCHIVE_STORAGE_S3_BUCKET" = "placeholder"
              + "LOCALSTACK"                           = "false"
              + "REGION"                               = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-01-12T19:25:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "PD5RmSEVjAYMZc1lvfSSn6O3RadR+J09hCPKVbQS/+g=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.audit_logs_archiver_code will be created
  + resource "aws_s3_object" "audit_logs_archiver_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-staging-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "audit_logs_archiver_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/audit_logs_archiver_code.zip"
      + source_hash            = "m/mF42mBPSutTiaRape0GvZe3RqSfUkxtziCLZ1lAzk="
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Error: Invalid combination of arguments

  with aws_lambda_event_source_mapping.audit_logs_dynamodb_stream_subscriber,
  on audit_logs_archiver.tf line 39, in resource "aws_lambda_event_source_mapping" "audit_logs_dynamodb_stream_subscriber":
  39: resource "aws_lambda_event_source_mapping" "audit_logs_dynamodb_stream_subscriber" {

"self_managed_event_source": one of
`event_source_arn,self_managed_event_source` must be specified

Error: Invalid combination of arguments

  with aws_lambda_event_source_mapping.audit_logs_dynamodb_stream_subscriber,
  on audit_logs_archiver.tf line 40, in resource "aws_lambda_event_source_mapping" "audit_logs_dynamodb_stream_subscriber":
  40:   event_source_arn                   = var.dynamodb_audit_logs_stream_arn

"event_source_arn": one of `event_source_arn,self_managed_event_source` must
be specified

Error: Missing required argument

  with aws_lambda_event_source_mapping.audit_logs_dynamodb_stream_subscriber,
  on audit_logs_archiver.tf line 61, in resource "aws_lambda_event_source_mapping" "audit_logs_dynamodb_stream_subscriber":
  61:       destination_arn = var.sqs_audit_logs_archiver_deadletter_queue_arn

The argument "destination_config.0.on_failure.0.destination_arn" is required,
but no definition was found.

Error: Null value found in list

  with data.aws_iam_policy_document.lambda_dynamodb,
  on iam.tf line 133, in data "aws_iam_policy_document" "lambda_dynamodb":
 133:     resources = [
 134:       var.dynamodb_relability_queue_arn,
 135:       var.dynamodb_vault_arn,
 136:       "${var.dynamodb_vault_arn}/index/*",
 137:       var.dynamodb_vault_stream_arn,
 138:       var.dynamodb_audit_logs_arn,
 139:       "${var.dynamodb_audit_logs_arn}/index/*",
 140:       var.dynamodb_audit_logs_stream_arn
 141:     ]

Null values are not allowed for this attribute value.

Error: Invalid template interpolation value

  on iam.tf line 223, in data "aws_iam_policy_document" "lambda_s3":
 223:       "${var.audit_logs_archive_storage_arn}/*"
    ├────────────────
    │ var.audit_logs_archive_storage_arn is null

The expression result is null. Cannot include a null value in a string
template.
time=2024-01-18T20:03:08Z level=error msg=terraform invocation failed in /home/runner/work/forms-terraform/forms-terraform/env/cloud/lambdas/.terragrunt-cache/ADB5PbtBRAnr3uwNv0kZMaQEidU/-syjFrdAaB-6kNXhMmF1nXBOp7o/lambdas prefix=[/home/runner/work/forms-terraform/forms-terraform/env/cloud/lambdas] 
time=2024-01-18T20:03:08Z level=error msg=1 error occurred:
	* [/home/runner/work/forms-terraform/forms-terraform/env/cloud/lambdas/.terragrunt-cache/ADB5PbtBRAnr3uwNv0kZMaQEidU/-syjFrdAaB-6kNXhMmF1nXBOp7o/lambdas] exit status 1



```

</details>

